Revit 2024 API
PointIterator Methods
The PointIterator type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Free
 Completes lifetime of the iterator. Call it when done using the iterator.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsDone
 Identifies if the iteration has reached the end of the collection.
MoveNext
 Increments the iterator to the next point in the collection.
Reset
 Resets the iterator to the beginning of the collection.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace